Tekla Open API Reference for Tekla Structures 2025
PluginBase.DefineInput Method
 The method Tekla Structures calls for the plug-in to query the input. The plug-in must then return a list of input definition instances. The plug-in will be dependent on the items it returns. Dependent means that if any of these items change, for example the user moves the points, the plug-in will be re-run with new input. DefineInput is not called during the re-run, and thus all the actual implementation should be in the Run() method. The maximum number of InputDefinitions in the List is 10.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract List<PluginBase.InputDefinition> DefineInput()
Public MustOverride Function DefineInput As List(Of PluginBase.InputDefinition)
Return Value
Type: List<PluginBase.InputDefinition>
A list of input definition instances. If the plug-in is not dependent on input, it should return an empty list (not null).
See Also
Reference
PluginBase Class
Tekla.Structures.Plugins Namespace